In [125]:
import pandas as pd
import numpy as np
from tensorflow.keras import Sequential
from tensorflow.keras.layers import Dense
from sklearn.metrics import classification_report
from sklearn.metrics import confusion_matrix
from sklearn.metrics import accuracy_score

gender_dataset = pd.read_csv('titanic/gender_submission.csv')
test_dataset = pd.read_csv('titanic/test.csv')
train_dataset = pd.read_csv('titanic/train.csv')

In [6]:
gender_dataset.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [14]:
test_dataset.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [13]:
test_dataset.shape

(418, 11)

In [8]:
train_dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
test_dataset.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [17]:
train_dataset.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [168]:
#x_values = train_dataset.iloc[:,[0,2,3,4,5,6,7,8,9,10]]
x_values = train_dataset.iloc[:,[2, 4, 6, 7]]
x_values.loc[x_values['Sex'] == 'male', 'Sex'] = 1
x_values.loc[x_values['Sex'] == 'female', 'Sex'] = 0
x_values['Sex'] = x_values['Sex'].astype(int)

C:\Users\hell-admin\PycharmProjects\deeplearning2\venv\lib\site-packages\pandas\core\indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)
<ipython-input-168-f86eac9f8050>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x_values['Sex'] = x_values['Sex'].astype(int)

In [169]:
x_values.head()

   Pclass  Sex  SibSp  Parch
0       3    1      1      0
1       1    0      1      0
2       3    0      0      0
3       1    0      1      0
4       3    1      0      0

In [156]:
x_values.dtypes

Pclass      int64
Sex         int32
Age       float64
SibSp       int64
Parch       int64
Fare      float64
dtype: object

In [170]:
y_values = train_dataset.iloc[:, 1]

In [171]:
y_values.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [172]:
model = Sequential()
# first hidden layer
# input_dim = variables for data
model.add(Dense(12, input_dim=4, activation='relu'))
# second hidden layer
model.add(Dense(8, activation='relu'))
# output layer
model.add(Dense(1, activation='sigmoid'))
model.compile(loss='binary_crossentropy', optimizer='adam', metrics=['accuracy'])

In [179]:
model.fit(np.asarray(x_values), np.asarray(y_values), epochs=150, batch_size=10, verbose=0)

In [177]:
testx = test_dataset.iloc[:, [1, 3, 5, 6]]
testx.loc[testx['Sex'] == 'male', 'Sex'] = 1
testx.loc[testx['Sex'] == 'female', 'Sex'] = 0
testx['Sex'] = testx['Sex'].astype(int)

C:\Users\hell-admin\PycharmProjects\deeplearning2\venv\lib\site-packages\pandas\core\indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)
<ipython-input-177-ea6daf7680bb>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  testx['Sex'] = testx['Sex'].astype(int)

In [178]:
testx.head()

   Pclass  Sex  SibSp  Parch
0       3    1      0      0
1       3    0      1      0
2       2    1      0      0
3       3    1      0      0
4       3    0      1      1

In [185]:
result = model.predict_classes(np.asarray(testx))

In [187]:
df = pd.DataFrame()
df['PassengerId'] = test_dataset['PassengerId']
df['Survived'] = result

In [189]:
df.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [192]:
df.to_csv('entry.csv', index=False)